Output from `terraform plan`
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.reload-pipeline["activities"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-activities-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["activities"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-activities-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["activities"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["activities"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["activities"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["activities"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Reload Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Archive Raw Data"                                     = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.allowed.s3.file.extensions"        = ".parquet"
                              + "--dpr.config.key"                        = "activities"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "activities"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "activities"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Invoke DMS State Control Lambda"                      = {
                      + Next           = "Start Glue Batch Job"
                      + Parameters     = {
                          + FunctionName = "dpr-pipeline-notification-function"
                          + Payload      = {
                              + replicationTaskArn = "arn:aws:dms:eu-west-2:972272129531:task:IY7ZQBNGSZFNBH7NCEVYBP5SFSFKCN33FXJSIBA"
                              + "token.$"          = "$$.Task.Token"
                            }
                        }
                      + Resource       = "arn:aws:states:::lambda:invoke.waitForTaskToken"
                      + Retry          = [
                          + {
                              + BackoffRate     = 2
                              + ErrorEquals     = [
                                  + "Lambda.ServiceException",
                                  + "Lambda.AWSLambdaException",
                                  + "Lambda.SdkClientException",
                                  + "Lambda.TooManyRequestsException",
                                ]
                              + IntervalSeconds = 60
                              + MaxAttempts     = 2
                            },
                        ]
                      + TimeoutSeconds = 86400
                      + Type           = "Task"
                    }
                  + "Resume DMS Replication Task"                          = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:IY7ZQBNGSZFNBH7NCEVYBP5SFSFKCN33FXJSIBA"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start DMS Replication Task"                           = {
                      + Next       = "Invoke DMS State Control Lambda"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:IY7ZQBNGSZFNBH7NCEVYBP5SFSFKCN33FXJSIBA"
                          + StartReplicationTaskType = "reload-target"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Archive Raw Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "activities"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-batch-activities-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "activities"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-activities-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-activities-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "activities"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "activities"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Start DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "activities"
                              + "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-raw-archive-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-activities-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "activities"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "activities"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reload-pipeline["activity-sch"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-activity-sch-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["activity-sch"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-activity-sch-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["activity-sch"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["activity-sch"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["activity-sch"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["activity-sch"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Reload Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Archive Raw Data"                                     = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.allowed.s3.file.extensions"        = ".parquet"
                              + "--dpr.config.key"                        = "activity-sch"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "activity-sch"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "activity-sch"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Invoke DMS State Control Lambda"                      = {
                      + Next           = "Start Glue Batch Job"
                      + Parameters     = {
                          + FunctionName = "dpr-pipeline-notification-function"
                          + Payload      = {
                              + replicationTaskArn = "arn:aws:dms:eu-west-2:972272129531:task:RV2CCPS2NOTLN2WSOSZETKVMYSCHG4EQJEBOQLA"
                              + "token.$"          = "$$.Task.Token"
                            }
                        }
                      + Resource       = "arn:aws:states:::lambda:invoke.waitForTaskToken"
                      + Retry          = [
                          + {
                              + BackoffRate     = 2
                              + ErrorEquals     = [
                                  + "Lambda.ServiceException",
                                  + "Lambda.AWSLambdaException",
                                  + "Lambda.SdkClientException",
                                  + "Lambda.TooManyRequestsException",
                                ]
                              + IntervalSeconds = 60
                              + MaxAttempts     = 2
                            },
                        ]
                      + TimeoutSeconds = 86400
                      + Type           = "Task"
                    }
                  + "Resume DMS Replication Task"                          = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:RV2CCPS2NOTLN2WSOSZETKVMYSCHG4EQJEBOQLA"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start DMS Replication Task"                           = {
                      + Next       = "Invoke DMS State Control Lambda"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:RV2CCPS2NOTLN2WSOSZETKVMYSCHG4EQJEBOQLA"
                          + StartReplicationTaskType = "reload-target"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Archive Raw Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "activity-sch"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-batch-activity-sch-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "activity-sch"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-activity-sch-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-activity-sch-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "activity-sch"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "activity-sch"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Start DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "activity-sch"
                              + "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-raw-archive-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-activity-sch-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "activity-sch"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "activity-sch"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reload-pipeline["adjudications"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-adjudications-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["adjudications"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-adjudications-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["adjudications"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["adjudications"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["adjudications"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["adjudications"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Reload Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Archive Raw Data"                                     = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.allowed.s3.file.extensions"        = ".parquet"
                              + "--dpr.config.key"                        = "adjudications"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "adjudications"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "adjudications"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Invoke DMS State Control Lambda"                      = {
                      + Next           = "Start Glue Batch Job"
                      + Parameters     = {
                          + FunctionName = "dpr-pipeline-notification-function"
                          + Payload      = {
                              + replicationTaskArn = "arn:aws:dms:eu-west-2:972272129531:task:6VTUH2XLK6BY7LHKIQNDHQNAY5RCQEXPUL5UMKA"
                              + "token.$"          = "$$.Task.Token"
                            }
                        }
                      + Resource       = "arn:aws:states:::lambda:invoke.waitForTaskToken"
                      + Retry          = [
                          + {
                              + BackoffRate     = 2
                              + ErrorEquals     = [
                                  + "Lambda.ServiceException",
                                  + "Lambda.AWSLambdaException",
                                  + "Lambda.SdkClientException",
                                  + "Lambda.TooManyRequestsException",
                                ]
                              + IntervalSeconds = 60
                              + MaxAttempts     = 2
                            },
                        ]
                      + TimeoutSeconds = 86400
                      + Type           = "Task"
                    }
                  + "Resume DMS Replication Task"                          = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:6VTUH2XLK6BY7LHKIQNDHQNAY5RCQEXPUL5UMKA"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start DMS Replication Task"                           = {
                      + Next       = "Invoke DMS State Control Lambda"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:6VTUH2XLK6BY7LHKIQNDHQNAY5RCQEXPUL5UMKA"
                          + StartReplicationTaskType = "reload-target"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Archive Raw Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "adjudications"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-batch-adjudications-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "adjudications"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-adjudications-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-adjudications-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "adjudications"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "adjudications"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Start DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "adjudications"
                              + "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-raw-archive-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-adjudications-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "adjudications"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "adjudications"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reload-pipeline["establishments"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-establishments-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["establishments"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-establishments-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["establishments"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["establishments"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["establishments"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["establishments"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Reload Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Archive Raw Data"                                     = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.allowed.s3.file.extensions"        = ".parquet"
                              + "--dpr.config.key"                        = "establishments"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "establishments"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "establishments"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Invoke DMS State Control Lambda"                      = {
                      + Next           = "Start Glue Batch Job"
                      + Parameters     = {
                          + FunctionName = "dpr-pipeline-notification-function"
                          + Payload      = {
                              + replicationTaskArn = "arn:aws:dms:eu-west-2:972272129531:task:YYI7QLUF5EY4MI5BATOJKEMMA273J4JSHDHYGLQ"
                              + "token.$"          = "$$.Task.Token"
                            }
                        }
                      + Resource       = "arn:aws:states:::lambda:invoke.waitForTaskToken"
                      + Retry          = [
                          + {
                              + BackoffRate     = 2
                              + ErrorEquals     = [
                                  + "Lambda.ServiceException",
                                  + "Lambda.AWSLambdaException",
                                  + "Lambda.SdkClientException",
                                  + "Lambda.TooManyRequestsException",
                                ]
                              + IntervalSeconds = 60
                              + MaxAttempts     = 2
                            },
                        ]
                      + TimeoutSeconds = 86400
                      + Type           = "Task"
                    }
                  + "Resume DMS Replication Task"                          = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:YYI7QLUF5EY4MI5BATOJKEMMA273J4JSHDHYGLQ"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start DMS Replication Task"                           = {
                      + Next       = "Invoke DMS State Control Lambda"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:YYI7QLUF5EY4MI5BATOJKEMMA273J4JSHDHYGLQ"
                          + StartReplicationTaskType = "reload-target"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Archive Raw Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "establishments"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-batch-establishments-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "establishments"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-establishments-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-establishments-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "establishments"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "establishments"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Start DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "establishments"
                              + "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-raw-archive-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-establishments-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "establishments"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "establishments"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reload-pipeline["incidents"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-incidents-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["incidents"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-incidents-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["incidents"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["incidents"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["incidents"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["incidents"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Reload Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Archive Raw Data"                                     = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.allowed.s3.file.extensions"        = ".parquet"
                              + "--dpr.config.key"                        = "incidents"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "incidents"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "incidents"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Invoke DMS State Control Lambda"                      = {
                      + Next           = "Start Glue Batch Job"
                      + Parameters     = {
                          + FunctionName = "dpr-pipeline-notification-function"
                          + Payload      = {
                              + replicationTaskArn = "arn:aws:dms:eu-west-2:972272129531:task:XHLLPEBO5KX4HH3XYPYGQ6T6ELLMGVANFTEMTXY"
                              + "token.$"          = "$$.Task.Token"
                            }
                        }
                      + Resource       = "arn:aws:states:::lambda:invoke.waitForTaskToken"
                      + Retry          = [
                          + {
                              + BackoffRate     = 2
                              + ErrorEquals     = [
                                  + "Lambda.ServiceException",
                                  + "Lambda.AWSLambdaException",
                                  + "Lambda.SdkClientException",
                                  + "Lambda.TooManyRequestsException",
                                ]
                              + IntervalSeconds = 60
                              + MaxAttempts     = 2
                            },
                        ]
                      + TimeoutSeconds = 86400
                      + Type           = "Task"
                    }
                  + "Resume DMS Replication Task"                          = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:XHLLPEBO5KX4HH3XYPYGQ6T6ELLMGVANFTEMTXY"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start DMS Replication Task"                           = {
                      + Next       = "Invoke DMS State Control Lambda"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:XHLLPEBO5KX4HH3XYPYGQ6T6ELLMGVANFTEMTXY"
                          + StartReplicationTaskType = "reload-target"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Archive Raw Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "incidents"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-batch-incidents-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "incidents"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-incidents-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-incidents-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "incidents"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "incidents"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Start DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "incidents"
                              + "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-raw-archive-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-incidents-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "incidents"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "incidents"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reload-pipeline["movements"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-movements-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["movements"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-movements-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["movements"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["movements"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["movements"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["movements"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Reload Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Archive Raw Data"                                     = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.allowed.s3.file.extensions"        = ".parquet"
                              + "--dpr.config.key"                        = "movements"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "movements"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "movements"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Invoke DMS State Control Lambda"                      = {
                      + Next           = "Start Glue Batch Job"
                      + Parameters     = {
                          + FunctionName = "dpr-pipeline-notification-function"
                          + Payload      = {
                              + replicationTaskArn = "arn:aws:dms:eu-west-2:972272129531:task:4WTNUHZJVBFTZFRR5UYI3MEMY4Q2BHXHOQQQOLQ"
                              + "token.$"          = "$$.Task.Token"
                            }
                        }
                      + Resource       = "arn:aws:states:::lambda:invoke.waitForTaskToken"
                      + Retry          = [
                          + {
                              + BackoffRate     = 2
                              + ErrorEquals     = [
                                  + "Lambda.ServiceException",
                                  + "Lambda.AWSLambdaException",
                                  + "Lambda.SdkClientException",
                                  + "Lambda.TooManyRequestsException",
                                ]
                              + IntervalSeconds = 60
                              + MaxAttempts     = 2
                            },
                        ]
                      + TimeoutSeconds = 86400
                      + Type           = "Task"
                    }
                  + "Resume DMS Replication Task"                          = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:4WTNUHZJVBFTZFRR5UYI3MEMY4Q2BHXHOQQQOLQ"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start DMS Replication Task"                           = {
                      + Next       = "Invoke DMS State Control Lambda"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:4WTNUHZJVBFTZFRR5UYI3MEMY4Q2BHXHOQQQOLQ"
                          + StartReplicationTaskType = "reload-target"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Archive Raw Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "movements"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-batch-movements-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "movements"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-movements-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-movements-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "movements"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "movements"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Start DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "movements"
                              + "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-raw-archive-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-movements-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "movements"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "movements"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reload-pipeline["person"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-person-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["person"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-person-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["person"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["person"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["person"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["person"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Reload Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Archive Raw Data"                                     = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.allowed.s3.file.extensions"        = ".parquet"
                              + "--dpr.config.key"                        = "person"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "person"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "person"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Invoke DMS State Control Lambda"                      = {
                      + Next           = "Start Glue Batch Job"
                      + Parameters     = {
                          + FunctionName = "dpr-pipeline-notification-function"
                          + Payload      = {
                              + replicationTaskArn = "arn:aws:dms:eu-west-2:972272129531:task:MWTRJ6GFDB67PR4AWQSXGZW2PCCXU5KC67LKEIA"
                              + "token.$"          = "$$.Task.Token"
                            }
                        }
                      + Resource       = "arn:aws:states:::lambda:invoke.waitForTaskToken"
                      + Retry          = [
                          + {
                              + BackoffRate     = 2
                              + ErrorEquals     = [
                                  + "Lambda.ServiceException",
                                  + "Lambda.AWSLambdaException",
                                  + "Lambda.SdkClientException",
                                  + "Lambda.TooManyRequestsException",
                                ]
                              + IntervalSeconds = 60
                              + MaxAttempts     = 2
                            },
                        ]
                      + TimeoutSeconds = 86400
                      + Type           = "Task"
                    }
                  + "Resume DMS Replication Task"                          = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:MWTRJ6GFDB67PR4AWQSXGZW2PCCXU5KC67LKEIA"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start DMS Replication Task"                           = {
                      + Next       = "Invoke DMS State Control Lambda"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:MWTRJ6GFDB67PR4AWQSXGZW2PCCXU5KC67LKEIA"
                          + StartReplicationTaskType = "reload-target"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Archive Raw Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "person"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-batch-person-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "person"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-person-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-person-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "person"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "person"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Start DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "person"
                              + "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-raw-archive-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-person-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "person"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "person"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reload-pipeline["prisoner"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-prisoner-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["prisoner"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-prisoner-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["prisoner"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["prisoner"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["prisoner"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["prisoner"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Reload Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Archive Raw Data"                                     = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.allowed.s3.file.extensions"        = ".parquet"
                              + "--dpr.config.key"                        = "prisoner"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "prisoner"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "prisoner"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Invoke DMS State Control Lambda"                      = {
                      + Next           = "Start Glue Batch Job"
                      + Parameters     = {
                          + FunctionName = "dpr-pipeline-notification-function"
                          + Payload      = {
                              + replicationTaskArn = "arn:aws:dms:eu-west-2:972272129531:task:GUTRQMDCJWP77442LSNV3B6VM6DGO6XYVDS7GTQ"
                              + "token.$"          = "$$.Task.Token"
                            }
                        }
                      + Resource       = "arn:aws:states:::lambda:invoke.waitForTaskToken"
                      + Retry          = [
                          + {
                              + BackoffRate     = 2
                              + ErrorEquals     = [
                                  + "Lambda.ServiceException",
                                  + "Lambda.AWSLambdaException",
                                  + "Lambda.SdkClientException",
                                  + "Lambda.TooManyRequestsException",
                                ]
                              + IntervalSeconds = 60
                              + MaxAttempts     = 2
                            },
                        ]
                      + TimeoutSeconds = 86400
                      + Type           = "Task"
                    }
                  + "Resume DMS Replication Task"                          = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:GUTRQMDCJWP77442LSNV3B6VM6DGO6XYVDS7GTQ"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start DMS Replication Task"                           = {
                      + Next       = "Invoke DMS State Control Lambda"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:GUTRQMDCJWP77442LSNV3B6VM6DGO6XYVDS7GTQ"
                          + StartReplicationTaskType = "reload-target"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Archive Raw Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "prisoner"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-batch-prisoner-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "prisoner"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-prisoner-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-prisoner-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "prisoner"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "prisoner"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Start DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "prisoner"
                              + "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-raw-archive-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-prisoner-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "prisoner"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "prisoner"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reload-pipeline["prisoner-address"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-prisoner-address-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["prisoner-address"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-prisoner-address-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["prisoner-address"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["prisoner-address"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["prisoner-address"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["prisoner-address"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Reload Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Archive Raw Data"                                     = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.allowed.s3.file.extensions"        = ".parquet"
                              + "--dpr.config.key"                        = "prisoner-address"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "prisoner-address"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "prisoner-address"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Invoke DMS State Control Lambda"                      = {
                      + Next           = "Start Glue Batch Job"
                      + Parameters     = {
                          + FunctionName = "dpr-pipeline-notification-function"
                          + Payload      = {
                              + replicationTaskArn = "arn:aws:dms:eu-west-2:972272129531:task:FREXK5UPU4WNDRSBBEAUGPGX5VO4IWJOGRYSF3Y"
                              + "token.$"          = "$$.Task.Token"
                            }
                        }
                      + Resource       = "arn:aws:states:::lambda:invoke.waitForTaskToken"
                      + Retry          = [
                          + {
                              + BackoffRate     = 2
                              + ErrorEquals     = [
                                  + "Lambda.ServiceException",
                                  + "Lambda.AWSLambdaException",
                                  + "Lambda.SdkClientException",
                                  + "Lambda.TooManyRequestsException",
                                ]
                              + IntervalSeconds = 60
                              + MaxAttempts     = 2
                            },
                        ]
                      + TimeoutSeconds = 86400
                      + Type           = "Task"
                    }
                  + "Resume DMS Replication Task"                          = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:FREXK5UPU4WNDRSBBEAUGPGX5VO4IWJOGRYSF3Y"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start DMS Replication Task"                           = {
                      + Next       = "Invoke DMS State Control Lambda"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:FREXK5UPU4WNDRSBBEAUGPGX5VO4IWJOGRYSF3Y"
                          + StartReplicationTaskType = "reload-target"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Archive Raw Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "prisoner-address"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-batch-prisoner-address-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "prisoner-address"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-prisoner-address-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-prisoner-address-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "prisoner-address"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "prisoner-address"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Start DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "prisoner-address"
                              + "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-raw-archive-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-prisoner-address-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "prisoner-address"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "prisoner-address"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reload-pipeline["prisoner-profile"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-prisoner-profile-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["prisoner-profile"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-prisoner-profile-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["prisoner-profile"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["prisoner-profile"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["prisoner-profile"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["prisoner-profile"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Reload Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Archive Raw Data"                                     = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.allowed.s3.file.extensions"        = ".parquet"
                              + "--dpr.config.key"                        = "prisoner-profile"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "prisoner-profile"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "prisoner-profile"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Invoke DMS State Control Lambda"                      = {
                      + Next           = "Start Glue Batch Job"
                      + Parameters     = {
                          + FunctionName = "dpr-pipeline-notification-function"
                          + Payload      = {
                              + replicationTaskArn = "arn:aws:dms:eu-west-2:972272129531:task:K3WCEFQEQNQBTDXPTJUDSMJGVHGXCM3SOWZQICY"
                              + "token.$"          = "$$.Task.Token"
                            }
                        }
                      + Resource       = "arn:aws:states:::lambda:invoke.waitForTaskToken"
                      + Retry          = [
                          + {
                              + BackoffRate     = 2
                              + ErrorEquals     = [
                                  + "Lambda.ServiceException",
                                  + "Lambda.AWSLambdaException",
                                  + "Lambda.SdkClientException",
                                  + "Lambda.TooManyRequestsException",
                                ]
                              + IntervalSeconds = 60
                              + MaxAttempts     = 2
                            },
                        ]
                      + TimeoutSeconds = 86400
                      + Type           = "Task"
                    }
                  + "Resume DMS Replication Task"                          = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:K3WCEFQEQNQBTDXPTJUDSMJGVHGXCM3SOWZQICY"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start DMS Replication Task"                           = {
                      + Next       = "Invoke DMS State Control Lambda"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:K3WCEFQEQNQBTDXPTJUDSMJGVHGXCM3SOWZQICY"
                          + StartReplicationTaskType = "reload-target"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Archive Raw Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "prisoner-profile"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-batch-prisoner-profile-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "prisoner-profile"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-prisoner-profile-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-prisoner-profile-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "prisoner-profile"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "prisoner-profile"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Start DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "prisoner-profile"
                              + "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-raw-archive-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-prisoner-profile-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "prisoner-profile"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "prisoner-profile"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reload-pipeline["reference"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-reference-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["reference"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-reference-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["reference"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["reference"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["reference"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["reference"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Reload Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Archive Raw Data"                                     = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.allowed.s3.file.extensions"        = ".parquet"
                              + "--dpr.config.key"                        = "reference"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "reference"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "reference"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Invoke DMS State Control Lambda"                      = {
                      + Next           = "Start Glue Batch Job"
                      + Parameters     = {
                          + FunctionName = "dpr-pipeline-notification-function"
                          + Payload      = {
                              + replicationTaskArn = "arn:aws:dms:eu-west-2:972272129531:task:EBIKCM53WRZFPHFT3J5IJG3ZATT643OC74SVVNQ"
                              + "token.$"          = "$$.Task.Token"
                            }
                        }
                      + Resource       = "arn:aws:states:::lambda:invoke.waitForTaskToken"
                      + Retry          = [
                          + {
                              + BackoffRate     = 2
                              + ErrorEquals     = [
                                  + "Lambda.ServiceException",
                                  + "Lambda.AWSLambdaException",
                                  + "Lambda.SdkClientException",
                                  + "Lambda.TooManyRequestsException",
                                ]
                              + IntervalSeconds = 60
                              + MaxAttempts     = 2
                            },
                        ]
                      + TimeoutSeconds = 86400
                      + Type           = "Task"
                    }
                  + "Resume DMS Replication Task"                          = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:EBIKCM53WRZFPHFT3J5IJG3ZATT643OC74SVVNQ"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start DMS Replication Task"                           = {
                      + Next       = "Invoke DMS State Control Lambda"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:EBIKCM53WRZFPHFT3J5IJG3ZATT643OC74SVVNQ"
                          + StartReplicationTaskType = "reload-target"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Archive Raw Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "reference"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-batch-reference-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "reference"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-reference-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-reference-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "reference"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "reference"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Start DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "reference"
                              + "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-raw-archive-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-reference-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "reference"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "reference"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reload-pipeline["sentence"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-sentence-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["sentence"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-sentence-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["sentence"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["sentence"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["sentence"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["sentence"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Reload Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Archive Raw Data"                                     = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.allowed.s3.file.extensions"        = ".parquet"
                              + "--dpr.config.key"                        = "sentence"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "sentence"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "sentence"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Invoke DMS State Control Lambda"                      = {
                      + Next           = "Start Glue Batch Job"
                      + Parameters     = {
                          + FunctionName = "dpr-pipeline-notification-function"
                          + Payload      = {
                              + replicationTaskArn = "arn:aws:dms:eu-west-2:972272129531:task:5IJQIVLTMPFSH46G7T3TNMC76FGNG7GPNK67JSI"
                              + "token.$"          = "$$.Task.Token"
                            }
                        }
                      + Resource       = "arn:aws:states:::lambda:invoke.waitForTaskToken"
                      + Retry          = [
                          + {
                              + BackoffRate     = 2
                              + ErrorEquals     = [
                                  + "Lambda.ServiceException",
                                  + "Lambda.AWSLambdaException",
                                  + "Lambda.SdkClientException",
                                  + "Lambda.TooManyRequestsException",
                                ]
                              + IntervalSeconds = 60
                              + MaxAttempts     = 2
                            },
                        ]
                      + TimeoutSeconds = 86400
                      + Type           = "Task"
                    }
                  + "Resume DMS Replication Task"                          = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:5IJQIVLTMPFSH46G7T3TNMC76FGNG7GPNK67JSI"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start DMS Replication Task"                           = {
                      + Next       = "Invoke DMS State Control Lambda"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:5IJQIVLTMPFSH46G7T3TNMC76FGNG7GPNK67JSI"
                          + StartReplicationTaskType = "reload-target"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Archive Raw Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "sentence"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-batch-sentence-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "sentence"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-sentence-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-sentence-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "sentence"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "sentence"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Start DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "sentence"
                              + "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-raw-archive-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-sentence-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "sentence"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "sentence"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.reload-pipeline["visits"].module.reload_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-reload-pipeline-nomis-visits-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.reload-pipeline["visits"].module.reload_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reload-pipeline-nomis-visits-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.reload-pipeline["visits"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["visits"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_dms_task_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["visits"].module.reload_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.reload-pipeline["visits"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Reload Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Archive Raw Data"                                     = {
                      + Next       = "Resume DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.allowed.s3.file.extensions"        = ".parquet"
                              + "--dpr.config.key"                        = "visits"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "visits"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "visits"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Invoke DMS State Control Lambda"                      = {
                      + Next           = "Start Glue Batch Job"
                      + Parameters     = {
                          + FunctionName = "dpr-pipeline-notification-function"
                          + Payload      = {
                              + replicationTaskArn = "arn:aws:dms:eu-west-2:972272129531:task:IQVXSK47QRYCAG4XY6EGZJNH7BVXHDHRHZ2IYLA"
                              + "token.$"          = "$$.Task.Token"
                            }
                        }
                      + Resource       = "arn:aws:states:::lambda:invoke.waitForTaskToken"
                      + Retry          = [
                          + {
                              + BackoffRate     = 2
                              + ErrorEquals     = [
                                  + "Lambda.ServiceException",
                                  + "Lambda.AWSLambdaException",
                                  + "Lambda.SdkClientException",
                                  + "Lambda.TooManyRequestsException",
                                ]
                              + IntervalSeconds = 60
                              + MaxAttempts     = 2
                            },
                        ]
                      + TimeoutSeconds = 86400
                      + Type           = "Task"
                    }
                  + "Resume DMS Replication Task"                          = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:IQVXSK47QRYCAG4XY6EGZJNH7BVXHDHRHZ2IYLA"
                          + StartReplicationTaskType = "resume-processing"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start DMS Replication Task"                           = {
                      + Next       = "Invoke DMS State Control Lambda"
                      + Parameters = {
                          + ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:IQVXSK47QRYCAG4XY6EGZJNH7BVXHDHRHZ2IYLA"
                          + StartReplicationTaskType = "reload-target"
                        }
                      + Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Archive Raw Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "visits"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-batch-visits-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "visits"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-visits-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-visits-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "visits"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "visits"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Start DMS Replication Task"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "visits"
                              + "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-raw-archive-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-reload-pipeline-nomis-visits-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

Plan: 78 to add, 0 to change, 0 to destroy.

```